# EA_DataAccSetStr

## Description
Set string value to the object, associated to the accessory index.

```pascal
PROCEDURE EA_DataAccSetStr(
				acc        : INTEGER;
				valueIndex : INTEGER;
				value      : STRING);
```

```python

def vs.EA_DataAccSetStr(acc, valueIndex, value):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|acc|INTEGER||
|valueIndex|INTEGER||
|value|STRING||

## Version
Availability: from Vectorworks 2016
## Category
* EnergyAnalysis Interface Library